app/views/carrito/index.html.erb


    <% current_user.carrito.carrito_items.each do |item| %>
---
SELECT "carritos".* FROM "carritos" WHERE "carritos"."user_id" = ? LIMIT ?  [["user_id", 3], ["LIMIT", 1]]
SELECT "carrito_items".* FROM "carrito_items" WHERE "carrito_items"."carrito_id" = ?  [["carrito_id", 1]]