app/views/tienda/index.html.erb

                        </li>
                        <% Product.distinct.pluck(:category).each do |category| %>
---
SELECT DISTINCT "products"."category" FROM "products"