app/controllers/carrito_controller.rb

SELECT "carritos".* FROM "carritos" WHERE "carritos"."user_id" = ? LIMIT ?  [["user_id", 1], ["LIMIT", 1]]
SELECT "carrito_items".* FROM "carrito_items" WHERE "carrito_items"."carrito_id" = ?  [["carrito_id", 1]]
---
  def index
    @carrito = current_user.carrito
    @productos_en_carrito = @carrito.carrito_items.map(&:product)

SELECT "products".* FROM "products" WHERE "products"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
INSERT INTO "carritos" ("user_id", "created_at", "updated_at") VALUES (?, ?, ?)  [["user_id", 1], ["created_at", "2023-10-16 00:27:40.608553"], ["updated_at", "2023-10-16 00:27:40.608553"]]
---
  def agregar_producto
    product = Product.find(params[:product_id])
    quantity = params[:quantity].to_i

    if current_user.carrito.nil?
      current_user.create_carrito # Crea un nuevo carrito si no existe

DELETE FROM "carrito_items" WHERE "carrito_items"."id" = ?  [["id", 14]]
SELECT "carrito_items".* FROM "carrito_items" WHERE "carrito_items"."carrito_id" = ? AND "carrito_items"."product_id" = ? LIMIT ?  [["carrito_id", 3], ["product_id", 1], ["LIMIT", 1]]
---
  def eliminar_producto
    product_id = params[:id]
    current_user.carrito.carrito_items.find_by(product_id: product_id).destroy