app/controllers/orders_controller.rb

  def create
    @order = current_user.orders.build(order_params)
    if @order.save
---
INSERT INTO "orders" ("user_id", "total", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user_id", 1], ["total", nil], ["created_at", "2023-10-19 15:17:50.592562"], ["updated_at", "2023-10-19 15:17:50.592562"]]