app/controllers/products_controller.rb

INSERT INTO "products" ("name", "description", "price", "stock", "category", "created_at", "updated_at", "user_id", "image") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    #@product = Product.new(product_params)
    @product = current_user.products.build(product_params)

    respond_to do |format|
      if @product.save

UPDATE "products" SET "category" = ?, "updated_at" = ? WHERE "products"."id" = ?  [["category", "Mascaras"], ["updated_at", "2023-10-19 17:00:13.230133"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @product.update(product_params)

DELETE FROM "carrito_items" WHERE "carrito_items"."id" = ?  [["id", 11]]
DELETE FROM "products" WHERE "products"."id" = ?  [["id", 1]]
---
  def destroy
    @product.carrito_items.destroy_all

SELECT "products".* FROM "products" WHERE "products"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def start_conversation
    product = Product.find(params[:id])