app/controllers/product_conversations_controller.rb

    def new
      @product = Product.find(params[:product_id])
---
SELECT "products".* FROM "products" WHERE "products"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

    def create
      @product = Product.find(params[:product_id])
---
SELECT "products".* FROM "products" WHERE "products"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]