app/controllers/registrations_controller.rb

    def create
      super do |resource|
        if resource.persisted?
          Carrito.create(user: resource) # Crea un carrito asociado al usuario
---
INSERT INTO "users" ("email", "encrypted_password", "reset_password_token", "reset_password_sent_at", "remember_created_at", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
INSERT INTO "carritos" ("user_id", "created_at", "updated_at") VALUES (?, ?, ?)  [["user_id", 3], ["created_at", "2023-10-15 22:13:16.222919"], ["updated_at", "2023-10-15 22:13:16.222919"]]