app/controllers/tienda_controller.rb

SELECT "products".* FROM "products" WHERE "products"."category" = ?  [["category", "Fruitas"]]
SELECT "products".* FROM "products"
---
  def index
    if params[:category].present?
      @categoria_seleccionada = params[:category]
      @products = Product.where(category: @categoria_seleccionada)
    else
      @products = Product.all