app/models/carrito.rb

  def add_product(producto, quantity)
    carrito_items.create(product: producto, quantity: quantity)
---
INSERT INTO "carrito_items" ("carrito_id", "product_id", "quantity", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["carrito_id", 1], ["product_id", 1], ["quantity", nil], ["created_at", "2023-10-15 22:17:22.772001"], ["updated_at", "2023-10-15 22:17:22.772001"]]